ws-asahi/WazamonoCore/megaavr/boards.txt
#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
# AVR-DU submenu options                     #
#____________________________________________#
# Chip (memory and pincount)             #
# 14/20-pin parts get default millis     #
# changed just like tinyAVRs do          #
#________________________________________#
avrdu.menu.chip.avr64du32=AVR64DU32
avrdu.menu.chip.avr64du28=AVR64DU28
avrdu.menu.chip.avr32du32=AVR32DU32
avrdu.menu.chip.avr32du28=AVR32DU28
avrdu.menu.chip.avr32du20=AVR32DU20
avrdu.menu.chip.avr32du14=AVR32DU14
avrdu.menu.chip.avr16du32=AVR16DU32
avrdu.menu.chip.avr16du28=AVR16DU28
avrdu.menu.chip.avr16du20=AVR16DU20
avrdu.menu.chip.avr16du14=AVR16DU14
avrdu.menu.chip.avr64du32.build.mcu=avr64du32
avrdu.menu.chip.avr64du32.upload.maximum_size=65536
avrdu.menu.chip.avr64du32.upload.maximum_data_size=8192
avrdu.menu.chip.avr64du32.build.variant=32pin-duseries
avrdu.menu.chip.avr64du32.build.highestcb=B2
avrdu.menu.chip.avr64du28.build.mcu=avr64du28
avrdu.menu.chip.avr64du28.upload.maximum_size=65536
avrdu.menu.chip.avr64du28.upload.maximum_data_size=8192
avrdu.menu.chip.avr64du28.build.variant=28pin-duseries
avrdu.menu.chip.avr32du32.build.mcu=avr32du32
avrdu.menu.chip.avr32du32.upload.maximum_size=32768
avrdu.menu.chip.avr32du32.upload.maximum_data_size=4096
avrdu.menu.chip.avr32du32.build.variant=32pin-duseries
avrdu.menu.chip.avr32du28.build.mcu=avr32du28
avrdu.menu.chip.avr32du28.upload.maximum_size=32768
avrdu.menu.chip.avr32du28.upload.maximum_data_size=4096
avrdu.menu.chip.avr32du28.build.variant=28pin-duseries
avrdu.menu.chip.avr32du20.build.mcu=avr32du20
avrdu.menu.chip.avr32du20.upload.maximum_size=32768
avrdu.menu.chip.avr32du20.upload.maximum_data_size=4096
avrdu.menu.chip.avr32du20.build.highestcb=B1
avrdu.menu.chip.avr32du20.build.variant=20pin-duseries
avrdu.menu.chip.avr32du20.build.defaultswaps=-DMUX_DEFAULT_USART1=2
avrdu.menu.chip.avr32du14.build.mcu=avr32du14
avrdu.menu.chip.avr32du14.upload.maximum_size=32768
avrdu.menu.chip.avr32du14.upload.maximum_data_size=4096
avrdu.menu.chip.avr32du14.build.highestcb=B1
avrdu.menu.chip.avr32du14.build.variant=14pin-duseries
avrdu.menu.chip.avr32du14.build.defaultswaps=-DMUX_DEFAULT_USART1=2
avrdu.menu.chip.avr16du32.build.mcu=avr16du32
avrdu.menu.chip.avr16du32.upload.maximum_size=16384
avrdu.menu.chip.avr16du32.upload.maximum_data_size=2048
avrdu.menu.chip.avr16du32.build.variant=32pin-duseries
avrdu.menu.chip.avr16du28.build.mcu=avr16du28
avrdu.menu.chip.avr16du28.upload.maximum_size=16384
avrdu.menu.chip.avr16du28.upload.maximum_data_size=2048
avrdu.menu.chip.avr16du28.build.variant=28pin-duseries
avrdu.menu.chip.avr16du20.build.mcu=avr16du20
avrdu.menu.chip.avr16du20.upload.maximum_size=16384
avrdu.menu.chip.avr16du20.upload.maximum_data_size=2048
avrdu.menu.chip.avr16du20.build.highestcb=B1
avrdu.menu.chip.avr16du20.build.variant=20pin-duseries
avrdu.menu.chip.avr16du20.build.defaultswaps=-DMUX_DEFAULT_USART1=2
avrdu.menu.chip.avr16du14.build.mcu=avr16du14
avrdu.menu.chip.avr16du14.upload.maximum_size=16384
avrdu.menu.chip.avr16du14.upload.maximum_data_size=2048
avrdu.menu.chip.avr16du14.build.highestcb=B1
avrdu.menu.chip.avr16du14.build.variant=14pin-duseries
avrdu.menu.chip.avr16du14.build.defaultswaps=-DMUX_DEFAULT_USART1=2

#----------------------------------------#
# Clock speed and source options         #
#________________________________________#
avrdu.menu.clock.24internal=24 MHz internal
avrdu.menu.clock.24internal.build.speed=24
avrdu.menu.clock.24internal.build.clocksource=0
avrdu.menu.clock.20internal=20 MHz internal
avrdu.menu.clock.20internal.build.speed=20
avrdu.menu.clock.20internal.build.clocksource=0
avrdu.menu.clock.16internal=16 MHz internal
avrdu.menu.clock.16internal.build.speed=16
avrdu.menu.clock.16internal.build.clocksource=0
avrdu.menu.clock.12internal=12 MHz internal
avrdu.menu.clock.12internal.build.speed=12
avrdu.menu.clock.12internal.build.clocksource=0
avrdu.menu.clock.24crystal=24 MHz crystal
avrdu.menu.clock.24crystal.build.speed=24
avrdu.menu.clock.24crystal.build.clocksource=1
avrdu.menu.clock.20crystal=20 MHz crystal
avrdu.menu.clock.20crystal.build.speed=20
avrdu.menu.clock.20crystal.build.clocksource=1
avrdu.menu.clock.16crystal=16 MHz crystal
avrdu.menu.clock.16crystal.build.speed=16
avrdu.menu.clock.16crystal.build.clocksource=1
avrdu.menu.clock.12crystal=12 MHz crystal
avrdu.menu.clock.12crystal.build.speed=12
avrdu.menu.clock.12crystal.build.clocksource=1
avrdu.menu.clock.16extclock=16 MHz External Clock
avrdu.menu.clock.16extclock.build.speed=16
avrdu.menu.clock.16extclock.build.clocksource=2
avrdu.menu.clock.20extclock=20 MHz External Clock
avrdu.menu.clock.20extclock.build.speed=20
avrdu.menu.clock.20extclock.build.clocksource=2
avrdu.menu.clock.24extclock=24 MHz External Clock
avrdu.menu.clock.24extclock.build.speed=24
avrdu.menu.clock.24extclock.build.clocksource=2

#----------------------------------------#
# BrownOut detection (BOD) options       #
#________________________________________#
avrdu.menu.bodvoltage.1v9=1.9V
avrdu.menu.bodvoltage.1v9.bootloader.bodlevbits=000
avrdu.menu.bodvoltage.2v45=2.45V
avrdu.menu.bodvoltage.2v45.bootloader.bodlevbits=001
avrdu.menu.bodvoltage.2v70=2.70V
avrdu.menu.bodvoltage.2v70.bootloader.bodlevbits=010
avrdu.menu.bodvoltage.2v85=2.85V
avrdu.menu.bodvoltage.2v85.bootloader.bodlevbits=011
avrdu.menu.bodmode.disabled=Disabled/Disabled
avrdu.menu.bodmode.enabled=Enabled/Enabled
avrdu.menu.bodmode.ensampfast=Enabled/Sampled (128 Hz)
avrdu.menu.bodmode.ensampslow=Enabled/Sampled (32 Hz)
avrdu.menu.bodmode.sampledfast=Sampled/Sampled (128 Hz)
avrdu.menu.bodmode.sampledslow=Sampled/Sampled (32 Hz)
avrdu.menu.bodmode.sampdisfast=Sampled/Disabled (128 Hz)
avrdu.menu.bodmode.sampdisslow=Sampled/Disabled (32 Hz)
avrdu.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
avrdu.menu.bodmode.disabled.bootloader.BODCFG=0x00
avrdu.menu.bodmode.enabled.bootloader.bodmodebits=00101
avrdu.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
avrdu.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
avrdu.menu.bodmode.samplefast.bootloader.bodmodebits=01010
avrdu.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
avrdu.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
avrdu.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
avrdu.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100


