ws-asahi/WazamonoCore/megaavr/boards.txt
#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
# AVR-EA submenu options                     #
#____________________________________________#
# Chip (memory and pincount)            #
#_______________________________________#
avrea.menu.chip.avr64ea28=AVR64EA28
avrea.menu.chip.avr64ea32=AVR64EA32
avrea.menu.chip.avr64ea48=AVR64EA48
avrea.menu.chip.avr32ea28=AVR32EA28
avrea.menu.chip.avr32ea32=AVR32EA32
avrea.menu.chip.avr32ea48=AVR32EA48
avrea.menu.chip.avr16ea28=AVR16EA28
avrea.menu.chip.avr16ea32=AVR16EA32
avrea.menu.chip.avr16ea48=AVR16EA48
# AVR64EA28
avrea.menu.chip.avr64ea28.build.mcu=avr64ea28
avrea.menu.chip.avr64ea28.build.variant=28pin-easeries
avrea.menu.chip.avr64ea28.upload.maximum_data_size=8192
avrea.menu.chip.avr64ea28.upload.maximum_size=65536
# AVR64EA32
avrea.menu.chip.avr64ea32.build.mcu=avr64ea32
avrea.menu.chip.avr64ea32.build.variant=32pin-easeries
avrea.menu.chip.avr64ea32.upload.maximum_data_size=8192
avrea.menu.chip.avr64ea32.upload.maximum_size=65536
# AVR64EA48
avrea.menu.chip.avr64ea48.build.mcu=avr64ea48
avrea.menu.chip.avr64ea48.build.variant=48pin-easeries
avrea.menu.chip.avr64ea48.upload.maximum_data_size=8192
avrea.menu.chip.avr64ea48.upload.maximum_size=65536
# AVR32EA28
avrea.menu.chip.avr32ea28.build.mcu=avr32ea28
avrea.menu.chip.avr32ea28.build.variant=28pin-easeries
avrea.menu.chip.avr32ea28.upload.maximum_data_size=4096
avrea.menu.chip.avr32ea28.upload.maximum_size=32768
# AVR32EA32
avrea.menu.chip.avr32ea32.build.mcu=avr32ea32
avrea.menu.chip.avr32ea32.build.variant=32pin-easeries
avrea.menu.chip.avr32ea32.upload.maximum_data_size=4096
avrea.menu.chip.avr32ea32.upload.maximum_size=32768
# AVR32EA48
avrea.menu.chip.avr32ea48.build.mcu=avr32ea48
avrea.menu.chip.avr32ea48.build.variant=48pin-easeries
avrea.menu.chip.avr32ea48.upload.maximum_data_size=4096
avrea.menu.chip.avr32ea48.upload.maximum_size=32768
# AVR16EA28
avrea.menu.chip.avr16ea28.build.mcu=avr16ea28
avrea.menu.chip.avr16ea28.build.variant=28pin-easeries
avrea.menu.chip.avr16ea28.upload.maximum_data_size=2048
avrea.menu.chip.avr16ea28.upload.maximum_size=16384
# AVR16EA32
avrea.menu.chip.avr16ea32.build.mcu=avr16ea32
avrea.menu.chip.avr16ea32.build.variant=32pin-easeries
avrea.menu.chip.avr16ea32.upload.maximum_data_size=2048
avrea.menu.chip.avr16ea32.upload.maximum_size=16384
# AVR16EA48
avrea.menu.chip.avr16ea48.build.mcu=avr16ea48
avrea.menu.chip.avr16ea48.build.variant=48pin-easeries
avrea.menu.chip.avr16ea48.upload.maximum_data_size=2048
avrea.menu.chip.avr16ea48.upload.maximum_size=16384

#----------------------------------------#
# Clock speed and source options         #
#________________________________________#
avrea.menu.clock.20internal=20 MHz internal
avrea.menu.clock.20internal.build.speed=20
avrea.menu.clock.20internal.build.clocksource=0
avrea.menu.clock.16internal=16 MHz internal
avrea.menu.clock.16internal.build.speed=16
avrea.menu.clock.16internal.build.clocksource=0
avrea.menu.clock.16internal.bootloader.oschffrq=1
avrea.menu.clock.10internal=10 MHz internal
avrea.menu.clock.10internal.build.speed=10
avrea.menu.clock.10internal.build.clocksource=0
avrea.menu.clock.8internal=8 MHz internal
avrea.menu.clock.8internal.build.speed=8
avrea.menu.clock.8internal.build.clocksource=0
avrea.menu.clock.8internal.bootloader.oschffrq=1
avrea.menu.clock.5internal=5 MHz internal
avrea.menu.clock.5internal.build.speed=5
avrea.menu.clock.5internal.build.clocksource=0
avrea.menu.clock.4internal=4 MHz internal
avrea.menu.clock.4internal.build.speed=4
avrea.menu.clock.4internal.build.clocksource=0
avrea.menu.clock.4internal.bootloader.oschffrq=1
avrea.menu.clock.1internal=1 MHz internal
avrea.menu.clock.1internal.build.speed=1
avrea.menu.clock.1internal.build.clocksource=0
avrea.menu.clock.1internal.bootloader.oschffrq=1
avrea.menu.clock.20crystal=20 MHz crystal
avrea.menu.clock.20crystal.build.speed=20
avrea.menu.clock.20crystal.build.clocksource=1
avrea.menu.clock.16crystal=16 MHz crystal
avrea.menu.clock.16crystal.build.speed=16
avrea.menu.clock.16crystal.build.clocksource=1
avrea.menu.clock.12crystal=12 MHz crystal
avrea.menu.clock.12crystal.build.speed=12
avrea.menu.clock.12crystal.build.clocksource=1
avrea.menu.clock.8crystal=8 MHz crystal
avrea.menu.clock.8crystal.build.speed=8
avrea.menu.clock.8crystal.build.clocksource=1
avrea.menu.clock.20extclock=20 MHz ext. clock
avrea.menu.clock.20extclock.build.speed=20
avrea.menu.clock.20extclock.build.clocksource=2
avrea.menu.clock.16extclock=16 MHz ext. clock
avrea.menu.clock.16extclock.build.speed=16
avrea.menu.clock.16extclock.build.clocksource=2
avrea.menu.clock.12extclock=12 MHz ext. clock
avrea.menu.clock.12extclock.build.speed=12
avrea.menu.clock.12extclock.build.clocksource=2
avrea.menu.clock.8extclock=8 MHz ext. clock
avrea.menu.clock.8extclock.build.speed=8
avrea.menu.clock.8extclock.build.clocksource=2
avrea.menu.clock.24crystal=24 MHz crystal (overclocked)
avrea.menu.clock.24crystal.build.speed=24
avrea.menu.clock.24crystal.build.clocksource=1
avrea.menu.clock.25crystal=25 MHz crystal (overclocked)
avrea.menu.clock.25crystal.build.speed=25
avrea.menu.clock.25crystal.build.clocksource=1
avrea.menu.clock.27crystal=27 MHz crystal (overclocked)
avrea.menu.clock.27crystal.build.speed=27
avrea.menu.clock.27crystal.build.clocksource=1
avrea.menu.clock.28crystal=28 MHz crystal (overclocked)
avrea.menu.clock.28crystal.build.speed=28
avrea.menu.clock.28crystal.build.clocksource=1
avrea.menu.clock.30crystal=30 MHz crystal (way overclocked)
avrea.menu.clock.30crystal.build.speed=30
avrea.menu.clock.30crystal.build.clocksource=1
avrea.menu.clock.32crystal=32 MHz crystal (way overclocked)
avrea.menu.clock.32crystal.build.speed=32
avrea.menu.clock.32crystal.build.clocksource=1
#avrea.menu.clock.36crystal=36 MHz crystal (unlikely-to-work overclocked)
#avrea.menu.clock.36crystal.build.speed=36
#avrea.menu.clock.36crystal.build.clocksource=1
#avrea.menu.clock.40crystal=40 MHz crystal (unlikely-to-work overclocked)
#avrea.menu.clock.40crystal.build.speed=40
#avrea.menu.clock.40crystal.build.clocksource=1
avrea.menu.clock.24extclock=24 MHz ext. clock (overclocked)
avrea.menu.clock.24extclock.build.speed=24
avrea.menu.clock.24extclock.build.clocksource=2
avrea.menu.clock.25extclock=25 MHz ext. clock (overclocked)
avrea.menu.clock.25extclock.build.speed=25
avrea.menu.clock.25extclock.build.clocksource=2
avrea.menu.clock.27extclock=27 MHz ext. clock (overclocked)
avrea.menu.clock.27extclock.build.speed=27
avrea.menu.clock.27extclock.build.clocksource=2
avrea.menu.clock.28extclock=28 MHz ext. clock (overclocked)
avrea.menu.clock.28extclock.build.speed=28
avrea.menu.clock.28extclock.build.clocksource=2
avrea.menu.clock.30extclock=30 MHz ext. clock (wayoverclocked)
avrea.menu.clock.30extclock.build.speed=30
avrea.menu.clock.30extclock.build.clocksource=2
avrea.menu.clock.32extclock=32 MHz ext. clock (way overclocked)
avrea.menu.clock.32extclock.build.speed=32
avrea.menu.clock.32extclock.build.clocksource=2
#avrea.menu.clock.36extclock=36 MHz ext. clock (unlikely-to-work overclocked)
#avrea.menu.clock.36extclock.build.speed=36
#avrea.menu.clock.36extclock.build.clocksource=2
#avrea.menu.clock.40extclock=40 MHz ext. clock (unlikely-to-work overclocked)
#avrea.menu.clock.40extclock.build.speed=40
#avrea.menu.clock.40extclock.build.clocksource=2

