ws-asahi/WazamonoCore/megaavr/boards.txt
#----------------------------------------#
# WDT MODE                               #
#________________________________________#
avrea.menu.WDTtimeout.disabled=Disabled (recommended)
avrea.menu.WDTtimeout.8seconds=Window remains open for 8 Seconds
avrea.menu.WDTtimeout.4seconds=Window remains open for 4 Seconds
avrea.menu.WDTtimeout.2seconds=Window remains open for 2 Seconds
avrea.menu.WDTtimeout.1second=Window remains open for 1 Second
avrea.menu.WDTtimeout.500msec=Window remains open for 500 milliseconds
avrea.menu.WDTtimeout.250msec=Window remains open for 250 milliseconds
avrea.menu.WDTtimeout.125msec=Window remains open for 125 milliseconds
avrea.menu.WDTtimeout.63msec=Window remains open for 62.5 milliseconds
avrea.menu.WDTwindow.disabled=No delay before window "opens"
avrea.menu.WDTwindow.8seconds=8 Second before window "opens"
avrea.menu.WDTwindow.4seconds=4 Second before window "opens"
avrea.menu.WDTwindow.2seconds=2 Second before window "opens"
avrea.menu.WDTwindow.1second=1 Second before window "opens"
avrea.menu.WDTwindow.500msec=500 millisecond before window "opens"
avrea.menu.WDTwindow.250msec=250 millisecond before window "opens"
avrea.menu.WDTwindow.125msec=125 millisecond before window "opens"
avrea.menu.WDTwindow.63msec=62.5 millisecond before window "opens"
avrea.menu.WDTtimeout.disabled.bootloader.wdttimeoutbits=0000
avrea.menu.WDTtimeout.8seconds.bootloader.wdttimeoutbits=1011
avrea.menu.WDTtimeout.4seconds.bootloader.wdttimeoutbits=1010
avrea.menu.WDTtimeout.2seconds.bootloader.wdttimeoutbits=1001
avrea.menu.WDTtimeout.1second.bootloader.wdttimeoutbits=1000
avrea.menu.WDTtimeout.500msec.bootloader.wdttimeoutbits=0111
avrea.menu.WDTtimeout.250msec.bootloader.wdttimeoutbits=0110
avrea.menu.WDTtimeout.125msec.bootloader.wdttimeoutbits=0101
avrea.menu.WDTtimeout.63msec.bootloader.wdttimeoutbits=0100
avrea.menu.WDTwindow.disabled.bootloader.wdtwindowbits=0000
avrea.menu.WDTwindow.8seconds.bootloader.wdtwindowbits=1011
avrea.menu.WDTwindow.4seconds.bootloader.wdtwindowbits=1010
avrea.menu.WDTwindow.2seconds.bootloader.wdtwindowbits=1001
avrea.menu.WDTwindow.1second.bootloader.wdtwindowbits=1000
avrea.menu.WDTwindow.500msec.bootloader.wdtwindowbits=0111
avrea.menu.WDTwindow.250msec.bootloader.wdtwindowbits=0110
avrea.menu.WDTwindow.125msec.bootloader.wdtwindowbits=0101
avrea.menu.WDTwindow.63msec.bootloader.wdtwindowbits=0100

#----------------------------------------#
# Flash Mapping options                  #
#________________________________________#
avrea.menu.flmap.lockdefault=Use last FLMAP section, lock FLMAP, provide PROGMEM_MAPPED
avrea.menu.flmap.unlocked=Start w/default, do not lock flmap. No PROGMEM_MAPPED.
avrea.menu.flmap.locksection0=Set FLMAP to section 0, lock FLMAP, provide PROGMEM_MAPPED
avrea.menu.flmap.lockdefault.build.flmapopts=-DLOCK_FLMAP -DFLMAPSECTION1
avrea.menu.flmap.unlocked.build.flmapopts=
avrea.menu.flmap.locksection0.build.flmapopts=-DLOCK_FLMAP -DFLMAPSECTION0
avrea.menu.flmap.lockdefault.build.flmapabr=.fld
avrea.menu.flmap.unlocked.build.flmapabr=.ful
avrea.menu.flmap.locksection0.build.flmapabr=.fl0

##########################################################################
###   ###                                                        ###   ###
####   ###  ##      ###  #     # ####      #####  ####      ##  ###   ####
#####   ###  ##    #   # #     # #   #     #      #   #    ##  ###   #####
######   ###  ##   #####  #   #  ####  ### ####   ####    ##  ###   ######
#####   ###  ##    #   #   # #   # #       #      #   #    ##  ###   #####
####   ###  ##     #   #    #    #  #      #####  ####      ##  ###   ####
###___###________________________________________________________###___###
#                                        #
# Parameters and defaults for EA parts   #
#________________________________________#
avreb.upload.tool=avrdude
avreb.upload.prog_interlock=
avreb.build.board=avreb
avreb.build.core=dxcore
avreb.upload.maximum_size=0
avreb.upload.maximum_data_size=0
# The maximum size and data size attributes are overridden by the selected chip. If you are avoiding specifying that somehow, there is no hope of anything working, so don't do that.
# Each top-level entry supports at lebst a dozen parts with varying memory constraints.
avreb.build.f_cpu={build.speed}000000L
avreb.build.text_section_start=.text=0x0
avreb.build.extra_flags=
avreb.build.export_merged_output=false
avreb.build.printf=
avreb.build.flmapopts=

#----------------------------------------#
# Bootloading parameters and fuses       #
#________________________________________#
avreb.bootloader.tool=avrdude
avreb.bootloader.WDTCFG=0b{bootloader.wdtwindowbits}{bootloader.wdttimeoutbits}
avreb.bootloader.oschffrq=0
avreb.bootloader.OSCCFG=0b0000{bootloader.oschffrq}000
avreb.bootloader.wdtwindowbits=0000
avreb.bootloader.wdttimeotbits=0000
avreb.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
avreb.bootloader.updipinbit=1
avreb.bootloader.SYSCFG0=0b110{bootloader.updipinbit}{bootloader.resetpinbit}0{bootloader.browsavebit}{bootloader.eesavebit}
avreb.bootloader.CODESIZE=0x00
avreb.bootloader.BOOTSIZE=0x01
avreb.bootloader.avrdudestring=
avreb.bootloader.pymcuprogstring=-aerase
avreb.bootloader.avrdudefuse5="-Ufuse5:w:{bootloader.SYSCFG0}:m"
avreb.bootloader.serupdifuse5=5:{bootloader.SYSCFG0}
#----------------------------------------#
# Upload and programming                 #
#________________________________________#
avreb.program.avrdudefuse5="-Ufuse5:w:{bootloader.SYSCFG0}:m"
avreb.program.serupdifuse5=5:{bootloader.SYSCFG0}
avreb.upload.tool=avrdude
avreb.upload.prog_interlock=
avreb.upload.maximum_size=0
avreb.upload.maximum_data_size=0

#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
avreb.build.mcupostfix=
avreb.build.printfabr=
avreb.build.flmapabr=.ful
avreb.build.attachabr=
avreb.build.wireabr=
##Not supported but still need empty string here.
avreb.build.appspmabr=

