ws-asahi/WazamonoCore/megaavr/boards.txt
#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
# AVR-EA submenu options                     #
#____________________________________________#
# Chip (memory and pincount)            #
#_______________________________________#
avreb.menu.chip.avr32eb32=AVR32EB32
avreb.menu.chip.avr32eb32.build.mcu=avr32eb32
avreb.menu.chip.avr32eb32.upload.maximum_size=32768
avreb.menu.chip.avr32eb32.upload.maximum_data_size=3072
avreb.menu.chip.avr32eb32.build.variant=32pin-ebseries
avreb.menu.chip.avr32eb28=AVR32EB28
avreb.menu.chip.avr32eb28.build.mcu=avr32eb28
avreb.menu.chip.avr32eb28.upload.maximum_size=32768
avreb.menu.chip.avr32eb28.upload.maximum_data_size=3072
avreb.menu.chip.avr32eb28.build.variant=28pin-ebseries
avreb.menu.chip.avr32eb20=AVR32EB20
avreb.menu.chip.avr32eb20.build.mcu=avr32eb20
avreb.menu.chip.avr32eb20.upload.maximum_size=32768
avreb.menu.chip.avr32eb20.upload.maximum_data_size=3072
avreb.menu.chip.avr32eb20.build.variant=20pin-ebseries
avreb.menu.chip.avr32eb14=AVR32EB14
avreb.menu.chip.avr32eb14.build.mcu=avr32eb14
avreb.menu.chip.avr32eb14.upload.maximum_size=32768
avreb.menu.chip.avr32eb14.upload.maximum_data_size=3072
avreb.menu.chip.avr32eb14.build.variant=14pin-ebseries
avreb.menu.chip.avr16eb32=AVR16EB32
avreb.menu.chip.avr16eb32.build.mcu=avr16eb32
avreb.menu.chip.avr16eb32.upload.maximum_size=16384
avreb.menu.chip.avr16eb32.upload.maximum_data_size=2048
avreb.menu.chip.avr16eb32.build.variant=32pin-ebseries
avreb.menu.chip.avr16eb28=AVR16EB28
avreb.menu.chip.avr16eb28.build.mcu=avr16eb28
avreb.menu.chip.avr16eb28.upload.maximum_size=16384
avreb.menu.chip.avr16eb28.upload.maximum_data_size=2048
avreb.menu.chip.avr16eb28.build.variant=28pin-ebseries
avreb.menu.chip.avr16eb20=AVR16EB20
avreb.menu.chip.avr16eb20.build.mcu=avr16eb20
avreb.menu.chip.avr16eb20.upload.maximum_size=16384
avreb.menu.chip.avr16eb20.upload.maximum_data_size=2048
avreb.menu.chip.avr16eb20.build.variant=20pin-ebseries
avreb.menu.chip.avr16eb14=AVR16EB14
avreb.menu.chip.avr16eb14.build.mcu=avr16eb14
avreb.menu.chip.avr16eb14.upload.maximum_size=16384
avreb.menu.chip.avr16eb14.upload.maximum_data_size=2048
avreb.menu.chip.avr16eb14.build.variant=14pin-ebseries

#----------------------------------------#
# Clock speed and source options         #
#________________________________________#
avreb.menu.clock.20internal=20 MHz internal
avreb.menu.clock.20internal.build.speed=20
avreb.menu.clock.20internal.build.clocksource=0
avreb.menu.clock.16internal=16 MHz internal
avreb.menu.clock.16internal.build.speed=16
avreb.menu.clock.16internal.build.clocksource=0
avreb.menu.clock.16internal.bootloader.oschffrq=1
avreb.menu.clock.10internal=10 MHz internal
avreb.menu.clock.10internal.build.speed=10
avreb.menu.clock.10internal.build.clocksource=0
avreb.menu.clock.8internal=8 MHz internal
avreb.menu.clock.8internal.build.speed=8
avreb.menu.clock.8internal.build.clocksource=0
avreb.menu.clock.8internal.bootloader.oschffrq=1
avreb.menu.clock.5internal=5 MHz internal
avreb.menu.clock.5internal.build.speed=5
avreb.menu.clock.5internal.build.clocksource=0
avreb.menu.clock.4internal=4 MHz internal
avreb.menu.clock.4internal.build.speed=4
avreb.menu.clock.4internal.build.clocksource=0
avreb.menu.clock.4internal.bootloader.oschffrq=1
avreb.menu.clock.1internal=1 MHz internal
avreb.menu.clock.1internal.build.speed=1
avreb.menu.clock.1internal.build.clocksource=0
avreb.menu.clock.1internal.bootloader.oschffrq=1
#avreb.menu.clock.20intpll=20 MHz int. w/80Mhz PLL
#avreb.menu.clock.20intpll.build.speed=20
#avreb.menu.clock.20intpll.build.clocksource=6
#avreb.menu.clock.16intpll=16 MHz int. w/64Mhz PLL
#avreb.menu.clock.16intpll.build.speed=16
#avreb.menu.clock.16intpll.build.clocksource=6
#avreb.menu.clock.16intpll.bootloader.oschffrq=1
#avreb.menu.clock.10intpll=10 MHz int. w/40Mhz PLL
#avreb.menu.clock.10intpll.build.speed=10
#avreb.menu.clock.10intpll.build.clocksource=6
#avreb.menu.clock.8intpll=8 MHz int. w/32 Mhz PLL
#avreb.menu.clock.8intpll.build.speed=8
#avreb.menu.clock.8intpll.build.clocksource=6
#avreb.menu.clock.8intpll.bootloader.oschffrq=1
#avreb.menu.clock.5intpll=5 MHz int. w/20Mhz PLL (??)
#avreb.menu.clock.5intpll.build.speed=5
#avreb.menu.clock.5intpll.build.clocksource=6
#avreb.menu.clock.4intpll=4 MHz int. w/16Mhz PLL (??)
#avreb.menu.clock.4intpll.build.speed=4
#avreb.menu.clock.4intpll.build.clocksource=6
#avreb.menu.clock.4intpll.bootloader.oschffrq=1
#avreb.menu.clock.20extpll=20 MHz ext. clock w/80 Mhz PLL
#avreb.menu.clock.20extpll.build.speed=20
#avreb.menu.clock.20extpll.build.clocksource=10
avreb.menu.clock.20extclock=20 MHz ext. clock
avreb.menu.clock.20extclock.build.speed=20
avreb.menu.clock.20extclock.build.clocksource=2
#avreb.menu.clock.16extpll=16 MHz ext. clock w/64 Mhz PLL
#avreb.menu.clock.16extpll.build.speed=16
#avreb.menu.clock.16extpll.build.clocksource=10
avreb.menu.clock.16extclock=16 MHz ext. clock
avreb.menu.clock.16extclock.build.speed=16
avreb.menu.clock.16extclock.build.clocksource=2
#avreb.menu.clock.12extpll=12 MHz ext. clock w/48 Mhz PLL
#avreb.menu.clock.12extpll.build.speed=12
#avreb.menu.clock.12extpll.build.clocksource=10
avreb.menu.clock.12extclock=12 MHz ext. clock
avreb.menu.clock.12extclock.build.speed=12
avreb.menu.clock.12extclock.build.clocksource=2
avreb.menu.clock.10extclock=10 MHz ext. clock
avreb.menu.clock.10extclock.build.speed=0
avreb.menu.clock.10extclock.build.clocksource=2
#avreb.menu.clock.8extpll=8 MHz ext. clock w/32 Mhz PLL
#avreb.menu.clock.8extpll.build.speed=8
#avreb.menu.clock.8extpll.build.clocksource=10
avreb.menu.clock.8extclock=8 MHz ext. clock
avreb.menu.clock.8extclock.build.speed=8
avreb.menu.clock.8extclock.build.clocksource=2
avreb.menu.clock.32extclock=32 MHz ext. clock (unlikely-to-work overclocked)
avreb.menu.clock.32extclock.build.speed=32
avreb.menu.clock.32extclock.build.clocksource=2
#avreb.menu.clock.25extpll=25 MHz ext. clock w/100 Mhz PLL (overclocked)
#avreb.menu.clock.25extpll.build.speed=25
#avreb.menu.clock.25extpll.build.clocksource=10
avreb.menu.clock.25extclock=25 MHz ext. clock (overclocked)
avreb.menu.clock.25extclock.build.speed=25
avreb.menu.clock.25extclock.build.clocksource=2
#avreb.menu.clock.24extpll=24 MHz ext. clock w/96 Mhz PLL (overclocked)
#avreb.menu.clock.24extpll.build.speed=24
#avreb.menu.clock.24extpll.build.clocksource=10
avreb.menu.clock.24extclock=24 MHz ext. clock (overclocked)
avreb.menu.clock.24extclock.build.speed=24
avreb.menu.clock.24extclock.build.clocksource=2
#avreb.menu.clock.32extpll=32 MHz ext. clock w/128 Mhz PLL (unlikely-to-work overclocked)
#avreb.menu.clock.32extpll.build.speed=32
#avreb.menu.clock.32extpll.build.clocksource=10

