ws-asahi/WazamonoCore/megaavr/boards.txt
#----------------------------------------#
# Upload parameters for Optiboot         #
#________________________________________#
avrdaopti.upload.tool=avrdude
avrdaopti.upload.protocol=arduino
avrdaopti.upload.extra_params=-D
avrdaopti.upload.speed=115200
avrdaopti.upload.prog_interlock="ERROR: Upload using programmer is not supported on optiboot boards"

#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
avrdaopti.build.mcupostfix=opti
avrdaopti.build.printfabr=
avrdaopti.build.flmapabr=.ful
avrdaopti.build.attachabr=
avrdaopti.build.wireabr=
avrdaopti.build.appspmabr=

#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
# AVR-DA (Optiboot) submenu options          #
#____________________________________________#
# Chip (memory and pincount)             #
#________________________________________#
avrdaopti.menu.chip.avr128da28=AVR128DA28
avrdaopti.menu.chip.avr128da32=AVR128DA32
avrdaopti.menu.chip.avr128da48=AVR128DA48
avrdaopti.menu.chip.avr128da64=AVR128DA64
avrdaopti.menu.chip.avr64da28=AVR64DA28
avrdaopti.menu.chip.avr64da32=AVR64DA32
avrdaopti.menu.chip.avr64da48=AVR64DA48
avrdaopti.menu.chip.avr64da64=AVR64DA64
avrdaopti.menu.chip.avr32da28=AVR32DA28
avrdaopti.menu.chip.avr32da32=AVR32DA32
avrdaopti.menu.chip.avr32da48=AVR32DA48
avrdaopti.menu.chip.avr128da28s=AVR128DA28S
avrdaopti.menu.chip.avr128da32s=AVR128DA32S
avrdaopti.menu.chip.avr128da48s=AVR128DA48S
avrdaopti.menu.chip.avr128da64s=AVR128DA64S
avrdaopti.menu.chip.avr64da28s=AVR64DA28S
avrdaopti.menu.chip.avr64da32s=AVR64DA32S
avrdaopti.menu.chip.avr64da48s=AVR64DA48S
avrdaopti.menu.chip.avr64da64s=AVR64DA64S
avrdaopti.menu.chip.avr32da28s=AVR32DA28S
avrdaopti.menu.chip.avr32da32s=AVR32DA32S
avrdaopti.menu.chip.avr32da48s=AVR32DA48S
# AVR128DA28
avrdaopti.menu.chip.avr128da28.build.mcu=avr128da28
avrdaopti.menu.chip.avr128da28.build.variant=28pin-standard
avrdaopti.menu.chip.avr128da28.upload.maximum_data_size=16384
avrdaopti.menu.chip.avr128da28.upload.maximum_size=130560
# AVR128DA32
avrdaopti.menu.chip.avr128da32.build.mcu=avr128da32
avrdaopti.menu.chip.avr128da32.build.variant=32pin-standard
avrdaopti.menu.chip.avr128da32.upload.maximum_data_size=16384
avrdaopti.menu.chip.avr128da32.upload.maximum_size=130560
# AVR128DA48
avrdaopti.menu.chip.avr128da48.build.mcu=avr128da48
avrdaopti.menu.chip.avr128da48.build.variant=48pin-standard
avrdaopti.menu.chip.avr128da48.upload.maximum_data_size=16384
avrdaopti.menu.chip.avr128da48.upload.maximum_size=130560
# AVR128DA64
avrdaopti.menu.chip.avr128da64.build.mcu=avr128da64
avrdaopti.menu.chip.avr128da64.build.variant=64pin-standard
avrdaopti.menu.chip.avr128da64.upload.maximum_data_size=16384
avrdaopti.menu.chip.avr128da64.upload.maximum_size=130560
# AVR64DA28
avrdaopti.menu.chip.avr64da28.build.mcu=avr64da28
avrdaopti.menu.chip.avr64da28.build.variant=28pin-standard
avrdaopti.menu.chip.avr64da28.upload.maximum_data_size=8192
avrdaopti.menu.chip.avr64da28.upload.maximum_size=65024
# AVR64DA32
avrdaopti.menu.chip.avr64da32.build.mcu=avr64da32
avrdaopti.menu.chip.avr64da32.build.variant=32pin-standard
avrdaopti.menu.chip.avr64da32.upload.maximum_data_size=8192
avrdaopti.menu.chip.avr64da32.upload.maximum_size=65024
# AVR64DA48
avrdaopti.menu.chip.avr64da48.build.mcu=avr64da48
avrdaopti.menu.chip.avr64da48.build.variant=48pin-standard
avrdaopti.menu.chip.avr64da48.upload.maximum_data_size=8192
avrdaopti.menu.chip.avr64da48.upload.maximum_size=65024
# AVR64DA64
avrdaopti.menu.chip.avr64da64.build.mcu=avr64da64
avrdaopti.menu.chip.avr64da64.build.variant=64pin-standard
avrdaopti.menu.chip.avr64da64.upload.maximum_data_size=8192
avrdaopti.menu.chip.avr64da64.upload.maximum_size=65024
# AVR32DA28
avrdaopti.menu.chip.avr32da28.build.mcu=avr32da28
avrdaopti.menu.chip.avr32da28.build.variant=28pin-standard
avrdaopti.menu.chip.avr32da28.upload.maximum_data_size=4096
avrdaopti.menu.chip.avr32da28.upload.maximum_size=32256
# AVR32DA32
avrdaopti.menu.chip.avr32da32.build.mcu=avr32da32
avrdaopti.menu.chip.avr32da32.build.variant=32pin-standard
avrdaopti.menu.chip.avr32da32.upload.maximum_data_size=4096
avrdaopti.menu.chip.avr32da32.upload.maximum_size=32256
# AVR32DA48
avrdaopti.menu.chip.avr32da48.build.mcu=avr32da48
avrdaopti.menu.chip.avr32da48.build.variant=48pin-standard
avrdaopti.menu.chip.avr32da48.upload.maximum_data_size=4096
avrdaopti.menu.chip.avr32da48.upload.maximum_size=32256
# AVR128DA28S
avrdaopti.menu.chip.avr128da28s.build.mcu=avr128da28s
avrdaopti.menu.chip.avr128da28s.build.variant=28pin-standard
avrdaopti.menu.chip.avr128da28s.upload.maximum_data_size=16384
avrdaopti.menu.chip.avr128da28s.upload.maximum_size=130560
# AVR128DA32S
avrdaopti.menu.chip.avr128da32s.build.mcu=avr128da32s
avrdaopti.menu.chip.avr128da32s.build.variant=32pin-standard
avrdaopti.menu.chip.avr128da32s.upload.maximum_data_size=16384
avrdaopti.menu.chip.avr128da32s.upload.maximum_size=130560
# AVR128DA48S
avrdaopti.menu.chip.avr128da48s.build.mcu=avr128da48s
avrdaopti.menu.chip.avr128da48s.build.variant=48pin-standard
avrdaopti.menu.chip.avr128da48s.upload.maximum_data_size=16384
avrdaopti.menu.chip.avr128da48s.upload.maximum_size=130560
# AVR128DA64S
avrdaopti.menu.chip.avr128da64s.build.mcu=avr128da64s
avrdaopti.menu.chip.avr128da64s.build.variant=64pin-standard
avrdaopti.menu.chip.avr128da64s.upload.maximum_data_size=16384
avrdaopti.menu.chip.avr128da64s.upload.maximum_size=130560
# AVR64DA28S
avrdaopti.menu.chip.avr64da28s.build.mcu=avr64da28s
avrdaopti.menu.chip.avr64da28s.build.variant=28pin-standard
avrdaopti.menu.chip.avr64da28s.upload.maximum_data_size=8192
avrdaopti.menu.chip.avr64da28s.upload.maximum_size=65024
# AVR64DA32S
avrdaopti.menu.chip.avr64da32s.build.mcu=avr64da32s
avrdaopti.menu.chip.avr64da32s.build.variant=32pin-standard
avrdaopti.menu.chip.avr64da32s.upload.maximum_data_size=8192
avrdaopti.menu.chip.avr64da32s.upload.maximum_size=65024
# AVR64DA48S
avrdaopti.menu.chip.avr64da48s.build.mcu=avr64da48s
avrdaopti.menu.chip.avr64da48s.build.variant=48pin-standard
avrdaopti.menu.chip.avr64da48s.upload.maximum_data_size=8192
avrdaopti.menu.chip.avr64da48s.upload.maximum_size=65024
# AVR64DA64S
avrdaopti.menu.chip.avr64da64s.build.mcu=avr64da64s
avrdaopti.menu.chip.avr64da64s.build.variant=64pin-standard
avrdaopti.menu.chip.avr64da64s.upload.maximum_data_size=8192
avrdaopti.menu.chip.avr64da64s.upload.maximum_size=65024
# AVR32DA28S
avrdaopti.menu.chip.avr32da28s.build.mcu=avr32da28s
avrdaopti.menu.chip.avr32da28s.build.variant=28pin-standard
avrdaopti.menu.chip.avr32da28s.upload.maximum_data_size=4096
avrdaopti.menu.chip.avr32da28s.upload.maximum_size=32256
# AVR32DA32S
avrdaopti.menu.chip.avr32da32s.build.mcu=avr32da32s
avrdaopti.menu.chip.avr32da32s.build.variant=32pin-standard
avrdaopti.menu.chip.avr32da32s.upload.maximum_data_size=4096
avrdaopti.menu.chip.avr32da32s.upload.maximum_size=32256
# AVR32DA48S
avrdaopti.menu.chip.avr32da48s.build.mcu=avr32da48s
avrdaopti.menu.chip.avr32da48s.build.variant=48pin-standard
avrdaopti.menu.chip.avr32da48s.upload.maximum_data_size=4096
avrdaopti.menu.chip.avr32da48s.upload.maximum_size=32256
# AVR32DA64S
avrdaopti.menu.chip.avr32da64s.build.mcu=avr32da64s
avrdaopti.menu.chip.avr32da64s.build.variant=64pin-standard
avrdaopti.menu.chip.avr32da64s.upload.maximum_data_size=4096
avrdaopti.menu.chip.avr32da64s.upload.maximum_size=32256

