ws-asahi/WazamonoCore/megaavr/boards.txt
#----------------------------------------#
# Clock speed and source options         #
#________________________________________#
avrdaopti.menu.clock.24internal=24 MHz internal
avrdaopti.menu.clock.24internal.build.speed=24
avrdaopti.menu.clock.24internal.build.clocksource=0
avrdaopti.menu.clock.20internal=20 MHz internal
avrdaopti.menu.clock.20internal.build.speed=20
avrdaopti.menu.clock.20internal.build.clocksource=0
avrdaopti.menu.clock.16internal=16 MHz internal
avrdaopti.menu.clock.16internal.build.speed=16
avrdaopti.menu.clock.16internal.build.clocksource=0
avrdaopti.menu.clock.12internal=12 MHz internal
avrdaopti.menu.clock.12internal.build.speed=12
avrdaopti.menu.clock.12internal.build.clocksource=0
avrdaopti.menu.clock.10internal=10 MHz internal
avrdaopti.menu.clock.10internal.build.speed=10
avrdaopti.menu.clock.10internal.build.clocksource=0
avrdaopti.menu.clock.8internal=8 MHz internal
avrdaopti.menu.clock.8internal.build.speed=8
avrdaopti.menu.clock.8internal.build.clocksource=0
avrdaopti.menu.clock.5internal=5 MHz internal
avrdaopti.menu.clock.5internal.build.speed=5
avrdaopti.menu.clock.5internal.build.clocksource=0
avrdaopti.menu.clock.4internal=4 MHz internal
avrdaopti.menu.clock.4internal.build.speed=4
avrdaopti.menu.clock.4internal.build.clocksource=0
avrdaopti.menu.clock.1internal=1 MHz internal
avrdaopti.menu.clock.1internal.build.speed=1
avrdaopti.menu.clock.1internal.build.clocksource=0
avrdaopti.menu.clock.24extclock=24 MHz ext. clock
avrdaopti.menu.clock.24extclock.build.speed=24
avrdaopti.menu.clock.24extclock.build.clocksource=2
avrdaopti.menu.clock.20extclock=20 MHz ext. clock
avrdaopti.menu.clock.20extclock.build.speed=20
avrdaopti.menu.clock.20extclock.build.clocksource=2
avrdaopti.menu.clock.16extclock=16 MHz ext. clock
avrdaopti.menu.clock.16extclock.build.speed=16
avrdaopti.menu.clock.16extclock.build.clocksource=2
avrdaopti.menu.clock.12extclock=12 MHz ext. clock
avrdaopti.menu.clock.12extclock.build.speed=12
avrdaopti.menu.clock.12extclock.build.clocksource=2
avrdaopti.menu.clock.10extclock=10 MHz ext. clock
avrdaopti.menu.clock.10extclock.build.speed=0
avrdaopti.menu.clock.10extclock.build.clocksource=2
avrdaopti.menu.clock.8extclock=8 MHz ext. clock
avrdaopti.menu.clock.8extclock.build.speed=8
avrdaopti.menu.clock.8extclock.build.clocksource=2
avrdaopti.menu.clock.28internal=28 MHz internal (overclocked)
avrdaopti.menu.clock.28internal.build.speed=28
avrdaopti.menu.clock.28internal.build.clocksource=0
avrdaopti.menu.clock.32internal=32 MHz internal (overclocked)
avrdaopti.menu.clock.32internal.build.speed=32
avrdaopti.menu.clock.32internal.build.clocksource=0
avrdaopti.menu.clock.25extclock=25 MHz ext. clock (slightly overclocked)
avrdaopti.menu.clock.25extclock.build.speed=25
avrdaopti.menu.clock.25extclock.build.clocksource=2
avrdaopti.menu.clock.27extclock=27 MHz ext. clock (overclocked)
avrdaopti.menu.clock.27extclock.build.speed=27
avrdaopti.menu.clock.27extclock.build.clocksource=2
avrdaopti.menu.clock.28extclock=28 MHz ext. clock (overclocked)
avrdaopti.menu.clock.28extclock.build.speed=28
avrdaopti.menu.clock.28extclock.build.clocksource=2
avrdaopti.menu.clock.30extclock=30 MHz ext. clock (overclocked)
avrdaopti.menu.clock.30extclock.build.speed=30
avrdaopti.menu.clock.30extclock.build.clocksource=2
avrdaopti.menu.clock.32extclock=32 MHz ext. clock (overclocked)
avrdaopti.menu.clock.32extclock.build.speed=32
avrdaopti.menu.clock.32extclock.build.clocksource=2
avrdaopti.menu.clock.36extclock=36 MHz ext. clock (highly overclocked)
avrdaopti.menu.clock.36extclock.build.speed=36
avrdaopti.menu.clock.36extclock.build.clocksource=2
avrdaopti.menu.clock.40extclock=40 MHz ext. clock (highly overclocked)
avrdaopti.menu.clock.40extclock.build.speed=40
avrdaopti.menu.clock.40extclock.build.clocksource=2
avrdaopti.menu.clock.48extclock=48 MHz ext. clock (WAY overclocked)
avrdaopti.menu.clock.48extclock.build.speed=48
avrdaopti.menu.clock.48extclock.build.clocksource=2


#----------------------------------------#
# BrownOut detection (BOD) options       #
#________________________________________#
avrdaopti.menu.bodvoltage.1v9=1.9V
avrdaopti.menu.bodvoltage.1v9.bootloader.bodlevbits=000
avrdaopti.menu.bodvoltage.2v45=2.45V
avrdaopti.menu.bodvoltage.2v45.bootloader.bodlevbits=001
avrdaopti.menu.bodvoltage.2v70=2.70V
avrdaopti.menu.bodvoltage.2v70.bootloader.bodlevbits=010
avrdaopti.menu.bodvoltage.2v85=2.85V
avrdaopti.menu.bodvoltage.2v85.bootloader.bodlevbits=011
avrdaopti.menu.bodmode.disabled=Disabled/Disabled
avrdaopti.menu.bodmode.enabled=Enabled/Enabled
avrdaopti.menu.bodmode.ensampfast=Enabled/Sampled (128 Hz)
avrdaopti.menu.bodmode.ensampslow=Enabled/Sampled (32 Hz)
avrdaopti.menu.bodmode.sampledfast=Sampled/Sampled (128 Hz)
avrdaopti.menu.bodmode.sampledslow=Sampled/Sampled (32 Hz)
avrdaopti.menu.bodmode.sampdisfast=Sampled/Disabled (128 Hz)
avrdaopti.menu.bodmode.sampdisslow=Sampled/Disabled (32 Hz)
avrdaopti.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
avrdaopti.menu.bodmode.disabled.bootloader.BODCFG=0x00
avrdaopti.menu.bodmode.enabled.bootloader.bodmodebits=00101
avrdaopti.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
avrdaopti.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
avrdaopti.menu.bodmode.samplefast.bootloader.bodmodebits=01010
avrdaopti.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
avrdaopti.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
avrdaopti.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
avrdaopti.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100


#----------------------------------------#
# millis/micros timing source            #
#________________________________________#
avrdaopti.menu.millis.tcb2=TCB2 (recommended)
avrdaopti.menu.millis.disabled=Disabled (delay() only)
avrdaopti.menu.millis.tcb0=TCB0
avrdaopti.menu.millis.tcb1=TCB1
avrdaopti.menu.millis.tcb3=TCB3 (48/64-pin parts only)
avrdaopti.menu.millis.tcb4=TCB4 (64-pin parts only)
avrdaopti.menu.millis.tca0=TCA0
avrdaopti.menu.millis.tca1=TCA1 (48/64-pin parts only)
avrdaopti.menu.millis.tcb0.build.millistimer=B0
avrdaopti.menu.millis.tcb1.build.millistimer=B1
avrdaopti.menu.millis.tcb2.build.millistimer=B2
avrdaopti.menu.millis.tcb3.build.millistimer=B3
avrdaopti.menu.millis.tcb4.build.millistimer=B4
avrdaopti.menu.millis.tca0.build.millistimer=A0
avrdaopti.menu.millis.tca1.build.millistimer=A1
avrdaopti.menu.millis.disabled.build.millistimer=NONE

