ws-asahi/WazamonoCore/megaavr/boards.txt
#----------------------------------------#
# printf() version options               #
#________________________________________#
avrdaopti.menu.printf.default=Default, 1.5k flash, no floats
avrdaopti.menu.printf.full=Full, 2.6k, prints floats
avrdaopti.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
avrdaopti.menu.printf.full.build.printfabr=.pfF
avrdaopti.menu.printf.minimal=Minimal, 1.1k flash used
avrdaopti.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
avrdaopti.menu.printf.minimal.build.printfabr=.pfM

#----------------------------------------#
# OPTIMIZATION OPTIONS                   #
#________________________________________#
#avrdaopti.menu.optimization.size=-Os (size)
#avrdaopti.menu.optimization.sizegcse=-Os (size, no GCSE)
#avrdaopti.menu.optimization.o3=-O3 (speed)
#avrdaopti.menu.optimization.o3gcse=-O3 (speed, no GCSE)
#avrdaopti.menu.optimization.size.build.optimizationlevel=-Os
#avrdaopti.menu.optimization.sizegcse.build.optimizationlevel=-Os
#avrdaopti.menu.optimization.o3.build.optimizationlevel=-O3
#avrdaopti.menu.optimization.o3gcse.build.optimizationlevel=-O3
#avrdaopti.menu.optimization.size.build.optabr=.Os
#avrdaopti.menu.optimization.sizegcse.build.optabr=.Osng
#avrdaopti.menu.optimization.o3.build.optabr=.O3
#avrdaopti.menu.optimization.o3gcse.build.optabr=.O3ng
#avrdaopti.menu.optimization.sizegcse.build.gcse=-fno-gcse
#avrdaopti.menu.optimization.o3gcse.build.gcse=-fno-gcse

#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#
avrdaopti.menu.attach.allenabled=On all pins, with new implementation.
avrdaopti.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
avrdaopti.menu.attach.manual=Only enabled ports. Please see documentation.
avrdaopti.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
avrdaopti.menu.attach.oldversion=Old version, (may fix bugs)
avrdaopti.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD
avrdaopti.menu.attach.manual.build.attachabr=.aMan
avrdaopti.menu.attach.oldversion.build.attachabr=.aOld

#----------------------------------------#
# Startup time options                   #
#________________________________________#
avrdaopti.menu.startuptime.8=8ms
avrdaopti.menu.startuptime.0=0ms
avrdaopti.menu.startuptime.1=1ms
avrdaopti.menu.startuptime.2=2ms
avrdaopti.menu.startuptime.4=4ms
avrdaopti.menu.startuptime.16=16ms
avrdaopti.menu.startuptime.32=32ms
avrdaopti.menu.startuptime.64=64ms
avrdaopti.menu.startuptime.0.bootloader.SYSCFG1=0x00
avrdaopti.menu.startuptime.1.bootloader.SYSCFG1=0x01
avrdaopti.menu.startuptime.2.bootloader.SYSCFG1=0x02
avrdaopti.menu.startuptime.4.bootloader.SYSCFG1=0x03
avrdaopti.menu.startuptime.8.bootloader.SYSCFG1=0x04
avrdaopti.menu.startuptime.16.bootloader.SYSCFG1=0x05
avrdaopti.menu.startuptime.32.bootloader.SYSCFG1=0x06
avrdaopti.menu.startuptime.64.bootloader.SYSCFG1=0x07

#-------------------------------------#
#         Wire Mode Selection         #
# To enable TWI1 or master+slave mode #
#_____________________________________#
avrdaopti.menu.wiremode.mors=1x Wire, Master or Slave (least Flash & RAM)
avrdaopti.menu.wiremode.mors.build.wiremode=MORS_SINGLE
avrdaopti.menu.wiremode.mors.build.wireabr=.wO
avrdaopti.menu.wiremode.mands=1x Wire, Master and Slave
avrdaopti.menu.wiremode.mands.build.wiremode=MANDS_SINGLE
avrdaopti.menu.wiremode.mands.build.wireabr=.wA
avrdaopti.menu.wiremode.mors2=2x Wire, Master or Slave (>28 pin only)
avrdaopti.menu.wiremode.mors2.build.wiremode=MORS_BOTH
avrdaopti.menu.wiremode.mors2.build.wireabr=.wO2
avrdaopti.menu.wiremode.mands2=2x Wire, Master and Slave (>28 pin only)
avrdaopti.menu.wiremode.mands2.build.wiremode=MANDS_BOTH
avrdaopti.menu.wiremode.mands2.build.wireabr=.wA2



#----------------------------------------#
# WDT MODE                               #
#________________________________________#
avrdaopti.menu.WDTtimeout.disabled=Disabled (recommended)
avrdaopti.menu.WDTtimeout.8seconds=Window remains open for 8 Seconds
avrdaopti.menu.WDTtimeout.4seconds=Window remains open for 4 Seconds
avrdaopti.menu.WDTtimeout.2seconds=Window remains open for 2 Seconds
avrdaopti.menu.WDTtimeout.1second=Window remains open for 1 Second
avrdaopti.menu.WDTtimeout.500msec=Window remains open for 500 milliseconds
avrdaopti.menu.WDTtimeout.250msec=Window remains open for 250 milliseconds
avrdaopti.menu.WDTtimeout.125msec=Window remains open for 125 milliseconds
avrdaopti.menu.WDTtimeout.63msec=Window remains open for 62.5 milliseconds
avrdaopti.menu.WDTwindow.disabled=No delay before window "opens"
avrdaopti.menu.WDTwindow.8seconds=8 Second before window "opens"
avrdaopti.menu.WDTwindow.4seconds=4 Second before window "opens"
avrdaopti.menu.WDTwindow.2seconds=2 Second before window "opens"
avrdaopti.menu.WDTwindow.1second=1 Second before window "opens"
avrdaopti.menu.WDTwindow.500msec=500 millisecond before window "opens"
avrdaopti.menu.WDTwindow.250msec=250 millisecond before window "opens"
avrdaopti.menu.WDTwindow.125msec=125 millisecond before window "opens"
avrdaopti.menu.WDTwindow.63msec=62.5 millisecond before window "opens"
avrdaopti.menu.WDTtimeout.disabled.bootloader.wdttimeoutbits=0000
avrdaopti.menu.WDTtimeout.8seconds.bootloader.wdttimeoutbits=1011
avrdaopti.menu.WDTtimeout.4seconds.bootloader.wdttimeoutbits=1010
avrdaopti.menu.WDTtimeout.2seconds.bootloader.wdttimeoutbits=1001
avrdaopti.menu.WDTtimeout.1second.bootloader.wdttimeoutbits=1000
avrdaopti.menu.WDTtimeout.500msec.bootloader.wdttimeoutbits=0111
avrdaopti.menu.WDTtimeout.250msec.bootloader.wdttimeoutbits=0110
avrdaopti.menu.WDTtimeout.125msec.bootloader.wdttimeoutbits=0101
avrdaopti.menu.WDTtimeout.63msec.bootloader.wdttimeoutbits=0100
avrdaopti.menu.WDTwindow.disabled.bootloader.wdtwindowbits=0000
avrdaopti.menu.WDTwindow.8seconds.bootloader.wdtwindowbits=1011
avrdaopti.menu.WDTwindow.4seconds.bootloader.wdtwindowbits=1010
avrdaopti.menu.WDTwindow.2seconds.bootloader.wdtwindowbits=1001
avrdaopti.menu.WDTwindow.1second.bootloader.wdtwindowbits=1000
avrdaopti.menu.WDTwindow.500msec.bootloader.wdtwindowbits=0111
avrdaopti.menu.WDTwindow.250msec.bootloader.wdtwindowbits=0110
avrdaopti.menu.WDTwindow.125msec.bootloader.wdtwindowbits=0101
avrdaopti.menu.WDTwindow.63msec.bootloader.wdtwindowbits=0100

