ws-asahi/WazamonoCore/megaavr/boards.txt
#----------------------------------------#
# BrownOut detection (BOD) options       #
#________________________________________#
avrdbopti.menu.bodvoltage.1v9=1.9V
avrdbopti.menu.bodvoltage.1v9.bootloader.bodlevbits=000
avrdbopti.menu.bodvoltage.2v45=2.45V
avrdbopti.menu.bodvoltage.2v45.bootloader.bodlevbits=001
avrdbopti.menu.bodvoltage.2v70=2.70V
avrdbopti.menu.bodvoltage.2v70.bootloader.bodlevbits=010
avrdbopti.menu.bodvoltage.2v85=2.85V
avrdbopti.menu.bodvoltage.2v85.bootloader.bodlevbits=011
avrdbopti.menu.bodmode.disabled=Disabled/Disabled
avrdbopti.menu.bodmode.enabled=Enabled/Enabled
avrdbopti.menu.bodmode.ensampfast=Enabled/Sampled (128 Hz)
avrdbopti.menu.bodmode.ensampslow=Enabled/Sampled (32 Hz)
avrdbopti.menu.bodmode.sampledfast=Sampled/Sampled (128 Hz)
avrdbopti.menu.bodmode.sampledslow=Sampled/Sampled (32 Hz)
avrdbopti.menu.bodmode.sampdisfast=Sampled/Disabled (128 Hz)
avrdbopti.menu.bodmode.sampdisslow=Sampled/Disabled (32 Hz)
avrdbopti.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
avrdbopti.menu.bodmode.disabled.bootloader.BODCFG=0x00
avrdbopti.menu.bodmode.enabled.bootloader.bodmodebits=00101
avrdbopti.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
avrdbopti.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
avrdbopti.menu.bodmode.samplefast.bootloader.bodmodebits=01010
avrdbopti.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
avrdbopti.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
avrdbopti.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
avrdbopti.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

#----------------------------------------#
# Reset pin as input option              #
#________________________________________#
avrdbopti.menu.resetpin.reset=PF6: Reset (default boot entry on reset pin & SW resets, 1 sec timeout)
avrdbopti.menu.resetpin.reset.bootloader.defaultentrycond=_extr
avrdbopti.menu.resetpin.reset.bootloader.resetpinbit=0
avrdbopti.menu.resetpin.input=PF6: Input (default boot entry on power on & SW resets, 8 sec timeout)
avrdbopti.menu.resetpin.input.bootloader.defaultentrycond=_all_8sec
avrdbopti.menu.resetpin.input.bootloader.resetpinbit=0

#----------------------------------------#
# Optiboot Entry Conditions              #
#________________________________________#
avrdbopti.menu.entrycond.default=Default (see documentation)
avrdbopti.menu.entrycond.extr=External (reset pin) (see documentation)
avrdbopti.menu.entrycond.extronly=External reset only (see documentation)
avrdbopti.menu.entrycond.all=Always (see documentation)
avrdbopti.menu.entrycond.poronly= Power On Only (see documentation)
avrdbopti.menu.entrycond.swr=SW-only: 8 second timeout (see documentation)
avrdbopti.menu.entrycond.extr_slow=External (reset pin), slow (see documentation)
avrdbopti.menu.entrycond.default.bootloader.entrycond={bootloader.defaultentrycond}
avrdbopti.menu.entrycond.extr.bootloader.entrycond=_extr
avrdbopti.menu.entrycond.extronly.bootloader.entrycond=_extronly
avrdbopti.menu.entrycond.poronly.bootloader.entrycond=_poronly_8sec
avrdbopti.menu.entrycond.all.bootloader.entrycond=_all_8sec
avrdbopti.menu.entrycond.swr.bootloader.entrycond=_swronly_8sec
avrdbopti.menu.entrycond.extr_slow.bootloader.entrycond=_extr_8sec

#----------------------------------------#
# millis/micros timing source            #
#________________________________________#
avrdbopti.menu.millis.tcb2=TCB2 (recommended)
avrdbopti.menu.millis.disabled=Disabled (delay() only)
avrdbopti.menu.millis.tcb0=TCB0
avrdbopti.menu.millis.tcb1=TCB1
avrdbopti.menu.millis.tcb3=TCB3 (48/64-pin parts only)
avrdbopti.menu.millis.tcb4=TCB4 (64-pin parts only)
avrdbopti.menu.millis.tca0=TCA0
avrdbopti.menu.millis.tca1=TCA1 (48/64-pin parts only)
avrdbopti.menu.millis.tcb0.build.millistimer=B0
avrdbopti.menu.millis.tcb1.build.millistimer=B1
avrdbopti.menu.millis.tcb2.build.millistimer=B2
avrdbopti.menu.millis.tcb3.build.millistimer=B3
avrdbopti.menu.millis.tcb4.build.millistimer=B4
avrdbopti.menu.millis.tca0.build.millistimer=A0
avrdbopti.menu.millis.tca1.build.millistimer=A1
avrdbopti.menu.millis.disabled.build.millistimer=NONE

#----------------------------------------#
# printf() version options               #
#________________________________________#
avrdbopti.menu.printf.default=Default (doesn't print floats, 1.4k flash use)
avrdbopti.menu.printf.full=Full, 2.6k, prints floats
avrdbopti.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
avrdbopti.menu.printf.full.build.printfabr=.pfF
avrdbopti.menu.printf.minimal=Minimal, 1.1k flash used
avrdbopti.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
avrdbopti.menu.printf.minimal.build.printfabr=.pfM

#----------------------------------------#
# OPTIMIZATION OPTIONS                   #
#________________________________________#
#avrdbopti.menu.optimization.size=-Os (size)
#avrdbopti.menu.optimization.sizegcse=-Os (size, no GCSE)
#avrdbopti.menu.optimization.o3=-O3 (speed)
#avrdbopti.menu.optimization.o3gcse=-O3 (speed, no GCSE)
#avrdbopti.menu.optimization.size.build.optimizationlevel=-Os
#avrdbopti.menu.optimization.sizegcse.build.optimizationlevel=-Os
#avrdbopti.menu.optimization.o3.build.optimizationlevel=-O3
#avrdbopti.menu.optimization.o3gcse.build.optimizationlevel=-O3
#avrdbopti.menu.optimization.size.build.optabr=.Os
#avrdbopti.menu.optimization.sizegcse.build.optabr=.Osng
#avrdbopti.menu.optimization.o3.build.optabr=.O3
#avrdbopti.menu.optimization.o3gcse.build.optabr=.O3ng
#avrdbopti.menu.optimization.sizegcse.build.gcse=-fno-gcse
#avrdbopti.menu.optimization.o3gcse.build.gcse=-fno-gcse

#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#
avrdbopti.menu.attach.allenabled=On all pins, with new implementation.
avrdbopti.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
avrdbopti.menu.attach.manual=Only enabled ports. Please see documentation.
avrdbopti.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
avrdbopti.menu.attach.oldversion=Old version, (may fix bugs)
avrdbopti.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD
avrdbopti.menu.attach.manual.build.attachabr=.aMan
avrdbopti.menu.attach.oldversion.build.attachabr=.aOld

