ws-asahi/WazamonoCore/megaavr/boards.txt
#----------------------------------------#
# MVIO menu                              #
#________________________________________#
avrdbopti.menu.mvioopti.enabled=Enabled (burn bootloader req'd)
avrdbopti.menu.mvioopti.enabled.bootloader.mviobits=01
avrdbopti.menu.mvioopti.enabled.build.mvioenable=-DMVIO_ENABLED
avrdbopti.menu.mvioopti.disabled=Disabled (burn bootloader req'd)
avrdbopti.menu.mvioopti.disabled.bootloader.mviobits=10
avrdbopti.menu.mvioopti.disabled.build.mvioenable=
avrdbopti.menu.mvioopti.reallyenabled=Enabled. "burn bootloader" done for sure.
avrdbopti.menu.mvioopti.reallyenabled.bootloader.mviobits=01
avrdbopti.menu.mvioopti.reallyenabled.build.mvioenable=-DMVIO_ENABLED -DASSUME_MVIO_FUSE
avrdbopti.menu.mvioopti.reallydisabled=Disabled. "burn bootloader" done for sure.
avrdbopti.menu.mvioopti.reallydisabled.bootloader.mviobits=10
avrdbopti.menu.mvioopti.reallydisabled.build.mvioenable=-DASSUME_MVIO_FUSE

#----------------------------------------#
# Startup time options                   #
#________________________________________#
avrdbopti.menu.startuptime.8=8ms
avrdbopti.menu.startuptime.0=0ms
avrdbopti.menu.startuptime.1=1ms
avrdbopti.menu.startuptime.2=2ms
avrdbopti.menu.startuptime.4=4ms
avrdbopti.menu.startuptime.16=16ms
avrdbopti.menu.startuptime.32=32ms
avrdbopti.menu.startuptime.64=64ms
avrdbopti.menu.startuptime.0.bootloader.sutbits=000
avrdbopti.menu.startuptime.1.bootloader.sutbits=001
avrdbopti.menu.startuptime.2.bootloader.sutbits=010
avrdbopti.menu.startuptime.4.bootloader.sutbits=011
avrdbopti.menu.startuptime.8.bootloader.sutbits=100
avrdbopti.menu.startuptime.16.bootloader.sutbits=101
avrdbopti.menu.startuptime.32.bootloader.sutbits=110
avrdbopti.menu.startuptime.64.bootloader.sutbits=111

#-------------------------------------#
#         Wire Mode Selection         #
# To enable TWI1 or master+slave mode #
#_____________________________________#
avrdbopti.menu.wiremode.mors=1x Wire, Master or Slave (least Flash & RAM)
avrdbopti.menu.wiremode.mors.build.wiremode=MORS_SINGLE
avrdbopti.menu.wiremode.mors.build.wireabr=.wO
avrdbopti.menu.wiremode.mands=1x Wire, Master and Slave
avrdbopti.menu.wiremode.mands.build.wiremode=MANDS_SINGLE
avrdbopti.menu.wiremode.mands.build.wireabr=.wA
avrdbopti.menu.wiremode.mors2=2x Wire, Master or Slave (>28 pin only)
avrdbopti.menu.wiremode.mors2.build.wiremode=MORS_BOTH
avrdbopti.menu.wiremode.mors2.build.wireabr=.wO2
avrdbopti.menu.wiremode.mands2=2x Wire, Master and Slave (>28 pin only)
avrdbopti.menu.wiremode.mands2.build.wiremode=MANDS_BOTH
avrdbopti.menu.wiremode.mands2.build.wireabr=.wA2

#----------------------------------------#
# Optiboot serial port                   #
#________________________________________#
avrdbopti.menu.bootloaderusart.ser0_alt=USART0 (alt): TX PA4, RX PA5
avrdbopti.menu.bootloaderusart.ser0_alt.bootloader.port=_ser0_alt
avrdbopti.menu.bootloaderusart.ser0_alt.bootloader.portname=Serial
avrdbopti.menu.bootloaderusart.ser0_alt.bootloader.portswap=1
avrdbopti.menu.bootloaderusart.ser0=USART0 (default pins): TX PA0, RX PA1 (int. clock only)
avrdbopti.menu.bootloaderusart.ser0.bootloader.port=_ser0
avrdbopti.menu.bootloaderusart.ser0.bootloader.portname=Serial
avrdbopti.menu.bootloaderusart.ser0.bootloader.portswap=0
avrdbopti.menu.bootloaderusart.ser1=USART1: TX PC0, RX PC1
avrdbopti.menu.bootloaderusart.ser1.bootloader.port=_ser1
avrdbopti.menu.bootloaderusart.ser1.bootloader.portname=Serial1
avrdbopti.menu.bootloaderusart.ser1.bootloader.portswap=0
avrdbopti.menu.bootloaderusart.ser1_alt=USART1 (alt): TX PC4, RX PC5 (48/64-pin only)
avrdbopti.menu.bootloaderusart.ser1_alt.bootloader.port=_ser1_alt
avrdbopti.menu.bootloaderusart.ser1_alt.bootloader.portname=Serial1
avrdbopti.menu.bootloaderusart.ser1_alt.bootloader.portswap=1
avrdbopti.menu.bootloaderusart.ser2=USART2: TX PF0, RX PF1
avrdbopti.menu.bootloaderusart.ser2.bootloader.port=_ser2
avrdbopti.menu.bootloaderusart.ser2.bootloader.portname=Serial2
avrdbopti.menu.bootloaderusart.ser2.bootloader.portswap=0
avrdbopti.menu.bootloaderusart.ser2_alt=USART2 (alt): TX PF4, RX PF5 (>28 pin only)
avrdbopti.menu.bootloaderusart.ser2_alt.bootloader.port=_ser2_alt
avrdbopti.menu.bootloaderusart.ser2_alt.bootloader.portname=Serial2
avrdbopti.menu.bootloaderusart.ser2_alt.bootloader.portswap=1
avrdbopti.menu.bootloaderusart.ser3=USART3: TX PB0, RX PB1 (48/64-pin only)
avrdbopti.menu.bootloaderusart.ser3.bootloader.port=_ser3
avrdbopti.menu.bootloaderusart.ser3.bootloader.portname=Serial3
avrdbopti.menu.bootloaderusart.ser3.bootloader.portswap=0
avrdbopti.menu.bootloaderusart.ser3_alt=USART3 (alt): TX PB4, RX PB5 (48/64-pin only)
avrdbopti.menu.bootloaderusart.ser3_alt.bootloader.port=_ser3_alt
avrdbopti.menu.bootloaderusart.ser3_alt.bootloader.portname=Serial3
avrdbopti.menu.bootloaderusart.ser3_alt.bootloader.portswap=1
avrdbopti.menu.bootloaderusart.ser4=USART4: TX PE0, RX PE1 (48/64-pin only)
avrdbopti.menu.bootloaderusart.ser4.bootloader.port=_ser4
avrdbopti.menu.bootloaderusart.ser4.bootloader.portname=Serial4
avrdbopti.menu.bootloaderusart.ser4.bootloader.portswap=0
avrdbopti.menu.bootloaderusart.ser4_alt=USART4 (alt): TX PE4, RX PE5 (64-pin only)
avrdbopti.menu.bootloaderusart.ser4_alt.bootloader.port=_ser4_alt
avrdbopti.menu.bootloaderusart.ser4_alt.bootloader.portname=Serial4
avrdbopti.menu.bootloaderusart.ser4_alt.bootloader.portswap=1
avrdbopti.menu.bootloaderusart.ser5=USART5: TX PG0, RX PG1 (64-pin only)
avrdbopti.menu.bootloaderusart.ser5.bootloader.port=_ser5
avrdbopti.menu.bootloaderusart.ser5.bootloader.portname=Serial5
avrdbopti.menu.bootloaderusart.ser5.bootloader.portswap=0
avrdbopti.menu.bootloaderusart.ser5_alt=USART5 (alt): TX PG4, RX PG5 (64-pin only)
avrdbopti.menu.bootloaderusart.ser5_alt.bootloader.port=_ser5_alt
avrdbopti.menu.bootloaderusart.ser5_alt.bootloader.portname=Serial5
avrdbopti.menu.bootloaderusart.ser5_alt.bootloader.portswap=1


#----------------------------------------#
# WDT MODE                               #
#________________________________________#
avrdbopti.menu.WDTtimeout.disabled=Disabled (recommended)
avrdbopti.menu.WDTtimeout.8seconds=Window remains open for 8 Seconds
avrdbopti.menu.WDTtimeout.4seconds=Window remains open for 4 Seconds
avrdbopti.menu.WDTtimeout.2seconds=Window remains open for 2 Seconds
avrdbopti.menu.WDTtimeout.1second=Window remains open for 1 Second
avrdbopti.menu.WDTtimeout.500msec=Window remains open for 500 milliseconds
avrdbopti.menu.WDTtimeout.250msec=Window remains open for 250 milliseconds
avrdbopti.menu.WDTtimeout.125msec=Window remains open for 125 milliseconds
avrdbopti.menu.WDTtimeout.63msec=Window remains open for 62.5 milliseconds
avrdbopti.menu.WDTwindow.disabled=No delay before window "opens"
avrdbopti.menu.WDTwindow.8seconds=8 Second before window "opens"
avrdbopti.menu.WDTwindow.4seconds=4 Second before window "opens"
avrdbopti.menu.WDTwindow.2seconds=2 Second before window "opens"
avrdbopti.menu.WDTwindow.1second=1 Second before window "opens"
avrdbopti.menu.WDTwindow.500msec=500 millisecond before window "opens"
avrdbopti.menu.WDTwindow.250msec=250 millisecond before window "opens"
avrdbopti.menu.WDTwindow.125msec=125 millisecond before window "opens"
avrdbopti.menu.WDTwindow.63msec=62.5 millisecond before window "opens"
avrdbopti.menu.WDTtimeout.disabled.bootloader.wdttimeoutbits=0000
avrdbopti.menu.WDTtimeout.8seconds.bootloader.wdttimeoutbits=1011
avrdbopti.menu.WDTtimeout.4seconds.bootloader.wdttimeoutbits=1010
avrdbopti.menu.WDTtimeout.2seconds.bootloader.wdttimeoutbits=1001
avrdbopti.menu.WDTtimeout.1second.bootloader.wdttimeoutbits=1000
avrdbopti.menu.WDTtimeout.500msec.bootloader.wdttimeoutbits=0111
avrdbopti.menu.WDTtimeout.250msec.bootloader.wdttimeoutbits=0110
avrdbopti.menu.WDTtimeout.125msec.bootloader.wdttimeoutbits=0101
avrdbopti.menu.WDTtimeout.63msec.bootloader.wdttimeoutbits=0100
avrdbopti.menu.WDTwindow.disabled.bootloader.wdtwindowbits=0000
avrdbopti.menu.WDTwindow.8seconds.bootloader.wdtwindowbits=1011
avrdbopti.menu.WDTwindow.4seconds.bootloader.wdtwindowbits=1010
avrdbopti.menu.WDTwindow.2seconds.bootloader.wdtwindowbits=1001
avrdbopti.menu.WDTwindow.1second.bootloader.wdtwindowbits=1000
avrdbopti.menu.WDTwindow.500msec.bootloader.wdtwindowbits=0111
avrdbopti.menu.WDTwindow.250msec.bootloader.wdtwindowbits=0110
avrdbopti.menu.WDTwindow.125msec.bootloader.wdtwindowbits=0101
avrdbopti.menu.WDTwindow.63msec.bootloader.wdtwindowbits=0100

