ws-asahi/WazamonoCore/megaavr/boards.txt
##########################################################################
#                                                                        #
#   ###  #     # ####      #####  ####           ###          #          #
#  #   # #     # #   #     #      #   #         #   #        ###  ##     #
#  #####  #   #  ####  ### ####   ####          #   #  ###    #          #
#  #   #   # #   # #       #      #   #         #   #  #  #   #   ##     #
#  #   #    #    #  #      #####  ####           ###   ###    #   ##     #
#______________________________________________________#_________________#
avrduusb.upload.tool=avrdude
avrduusb.upload.prog_interlock=
avrduusb.build.board=avrdu
avrduusb.build.core=dxcore
avrduusb.upload.maximum_size=0
avrduusb.upload.maximum_data_size=0
avrduusb.build.f_cpu={build.speed}000000L
avrduusb.build.text_section_start=.text=0x1000
avrduusb.build.defaultswaps=
avrduusb.build.extra_flags= {build.defaultswaps} -DUSING_AVRDU_CDC_BOOTLOADER -DUSING_OPTIBOOT -DUSB_PID=0xDA33
avrduusb.build.export_merged_output=false
avrduusb.build.highestcb=B2
avrduusb.build.printf=
avrduusb.build.flmapopts=
avrduusb.build.attachmode=-DCORE_ATTACH_ALL
avrduusb.bootloader.tool=avrdude
avrduusb.bootloader.WDTCFG=0b{bootloader.wdtwindowbits}{bootloader.wdttimeoutbits}
avrduusb.bootloader.wdtwindowbits=0000
avrduusb.bootloader.wdttimeotbits=0000
avrduusb.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
avrduusb.bootloader.updipinbit=1
avrduusb.bootloader.SYSCFG0=0b110{bootloader.updipinbit}{bootloader.resetpinbits}00{bootloader.eesavebit}
avrduusb.bootloader.SYSCFG1=0b00001{bootloader.sutbits}
avrduusb.bootloader.CODESIZE=0x00
avrduusb.bootloader.BOOTSIZE=0x08
avrduusb.bootloader.OSCCFG=0b00000000
avrduusb.bootloader.resetpinbits={bootloader.resetpinbit}
avrduusb.bootloader.avrdudefuse5="-Ufuse5:w:{bootloader.SYSCFG0}:m"
avrduusb.program.avrdudefuse5="-Ufuse5:w:{bootloader.SYSCFG0}:m"
avrduusb.menu.eesave.enable=EEPROM retained
avrduusb.menu.eesave.enable.bootloader.eesavebit=1
avrduusb.menu.eesave.disable=EEPROM not retained
avrduusb.menu.eesave.disable.bootloader.eesavebit=0
avrduusb.bootloader.avrdudestring=-Uflash:w:{bootloader.file}:i
avrduusb.bootloader.pymcuprogstring=-aerase
avrduusb.build.mcupostfix=
avrduusb.build.printfabr=
avrduusb.build.flmapabr=.ful
avrduusb.build.attachabr=
avrduusb.build.wireabr=
avrduusb.build.appspmabr=
avrduusb.menu.clock.24internal=24 MHz internal
avrduusb.menu.clock.24internal.build.speed=24
avrduusb.menu.clock.24internal.build.clocksource=0
avrduusb.menu.clock.20internal=20 MHz internal
avrduusb.menu.clock.20internal.build.speed=20
avrduusb.menu.clock.20internal.build.clocksource=0
avrduusb.menu.clock.16internal=16 MHz internal
avrduusb.menu.clock.16internal.build.speed=16
avrduusb.menu.clock.16internal.build.clocksource=0
avrduusb.menu.clock.12internal=12 MHz internal
avrduusb.menu.clock.12internal.build.speed=12
avrduusb.menu.clock.12internal.build.clocksource=0
avrduusb.menu.clock.24crystal=24 MHz crystal
avrduusb.menu.clock.24crystal.build.speed=24
avrduusb.menu.clock.24crystal.build.clocksource=1
avrduusb.menu.clock.20crystal=20 MHz crystal
avrduusb.menu.clock.20crystal.build.speed=20
avrduusb.menu.clock.20crystal.build.clocksource=1
avrduusb.menu.clock.16crystal=16 MHz crystal
avrduusb.menu.clock.16crystal.build.speed=16
avrduusb.menu.clock.16crystal.build.clocksource=1
avrduusb.menu.clock.12crystal=12 MHz crystal
avrduusb.menu.clock.12crystal.build.speed=12
avrduusb.menu.clock.12crystal.build.clocksource=1
avrduusb.menu.clock.16extclock=16 MHz External Clock
avrduusb.menu.clock.16extclock.build.speed=16
avrduusb.menu.clock.16extclock.build.clocksource=2
avrduusb.menu.clock.20extclock=20 MHz External Clock
avrduusb.menu.clock.20extclock.build.speed=20
avrduusb.menu.clock.20extclock.build.clocksource=2
avrduusb.menu.clock.24extclock=24 MHz External Clock
avrduusb.menu.clock.24extclock.build.speed=24
avrduusb.menu.clock.24extclock.build.clocksource=2
avrduusb.menu.bodvoltage.1v9=1.9V
avrduusb.menu.bodvoltage.1v9.bootloader.bodlevbits=000
avrduusb.menu.bodvoltage.2v45=2.45V
avrduusb.menu.bodvoltage.2v45.bootloader.bodlevbits=001
avrduusb.menu.bodvoltage.2v70=2.70V
avrduusb.menu.bodvoltage.2v70.bootloader.bodlevbits=010
avrduusb.menu.bodvoltage.2v85=2.85V
avrduusb.menu.bodvoltage.2v85.bootloader.bodlevbits=011
avrduusb.menu.bodmode.disabled=Disabled/Disabled
avrduusb.menu.bodmode.enabled=Enabled/Enabled
avrduusb.menu.bodmode.ensampfast=Enabled/Sampled (128 Hz)
avrduusb.menu.bodmode.ensampslow=Enabled/Sampled (32 Hz)
avrduusb.menu.bodmode.sampledfast=Sampled/Sampled (128 Hz)
avrduusb.menu.bodmode.sampledslow=Sampled/Sampled (32 Hz)
avrduusb.menu.bodmode.sampdisfast=Sampled/Disabled (128 Hz)
avrduusb.menu.bodmode.sampdisslow=Sampled/Disabled (32 Hz)
avrduusb.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
avrduusb.menu.bodmode.disabled.bootloader.BODCFG=0x00
avrduusb.menu.bodmode.enabled.bootloader.bodmodebits=00101
avrduusb.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
avrduusb.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
avrduusb.menu.bodmode.samplefast.bootloader.bodmodebits=01010
avrduusb.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
avrduusb.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
avrduusb.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
avrduusb.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100
avrduusb.menu.resetpin.reset=Hardware Reset (recommended)
avrduusb.menu.resetpin.reset.bootloader.resetpinbit=1
avrduusb.menu.resetpin.input=Input (no output, ever)
avrduusb.menu.resetpin.input.bootloader.resetpinbit=0
avrduusb.menu.millis.tcbhighest=Default (recommended)
avrduusb.menu.millis.disabled=Disabled (delay() only)
avrduusb.menu.millis.tcb0=TCB0
avrduusb.menu.millis.tcb1=TCB1 (default)
avrduusb.menu.millis.tca0=TCA0
avrduusb.menu.millis.tcbhighest.build.millistimer=B1
avrduusb.menu.millis.tcb0.build.millistimer=B0
avrduusb.menu.millis.tcb1.build.millistimer=B1
avrduusb.menu.millis.tca0.build.millistimer=A0
avrduusb.menu.millis.disabled.build.millistimer=NONE
avrduusb.menu.printf.default=Default, 1.5k flash, no floats
avrduusb.menu.printf.full=Full, 2.6k, prints floats
avrduusb.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
avrduusb.menu.printf.full.build.printfabr=.pfF
avrduusb.menu.printf.minimal=Minimal, 1.1k flash used
avrduusb.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
avrduusb.menu.printf.minimal.build.printfabr=.pfM
avrduusb.menu.attach.allenabled=On all pins, with new implementation.
avrduusb.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
avrduusb.menu.attach.manual=Only enabled ports. Please see documentation.
avrduusb.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
avrduusb.menu.attach.oldversion=Old version, may fix bugs.
avrduusb.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD
avrduusb.menu.attach.manual.build.attachabr=.aMan
avrduusb.menu.attach.oldversion.build.attachabr=.aOld
avrduusb.menu.startuptime.8=8ms
avrduusb.menu.startuptime.0=0ms
avrduusb.menu.startuptime.1=1ms
avrduusb.menu.startuptime.2=2ms
avrduusb.menu.startuptime.4=4ms
avrduusb.menu.startuptime.16=16ms
avrduusb.menu.startuptime.32=32ms
avrduusb.menu.startuptime.64=64ms
avrduusb.menu.startuptime.0.bootloader.sutbits=000
avrduusb.menu.startuptime.1.bootloader.sutbits=001
avrduusb.menu.startuptime.2.bootloader.sutbits=010
avrduusb.menu.startuptime.4.bootloader.sutbits=011
avrduusb.menu.startuptime.8.bootloader.sutbits=100
avrduusb.menu.startuptime.16.bootloader.sutbits=101
avrduusb.menu.startuptime.32.bootloader.sutbits=110
avrduusb.menu.startuptime.64.bootloader.sutbits=111
avrduusb.menu.wiremode.mors= Master or Slave
avrduusb.menu.wiremode.mors.build.wiremode=MORS_SINGLE
avrduusb.menu.wiremode.mors.build.wireabr=.wO
avrduusb.menu.wiremode.mands=Master and Slave
avrduusb.menu.wiremode.mands.build.wiremode=MANDS_SINGLE
avrduusb.menu.wiremode.mands.build.wireabr=.wA
avrduusb.menu.WDTtimeout.disabled=Disabled (recommended)
avrduusb.menu.WDTtimeout.8seconds=Window remains open for 8 Seconds
avrduusb.menu.WDTtimeout.4seconds=Window remains open for 4 Seconds
avrduusb.menu.WDTtimeout.2seconds=Window remains open for 2 Seconds
avrduusb.menu.WDTtimeout.1second=Window remains open for 1 Second
avrduusb.menu.WDTtimeout.500msec=Window remains open for 500 milliseconds
avrduusb.menu.WDTtimeout.250msec=Window remains open for 250 milliseconds
avrduusb.menu.WDTtimeout.125msec=Window remains open for 125 milliseconds
avrduusb.menu.WDTtimeout.63msec=Window remains open for 62.5 milliseconds
avrduusb.menu.WDTwindow.disabled=No delay before window "opens"
avrduusb.menu.WDTwindow.8seconds=8 Second before window "opens"
avrduusb.menu.WDTwindow.4seconds=4 Second before window "opens"
avrduusb.menu.WDTwindow.2seconds=2 Second before window "opens"
avrduusb.menu.WDTwindow.1second=1 Second before window "opens"
avrduusb.menu.WDTwindow.500msec=500 millisecond before window "opens"
avrduusb.menu.WDTwindow.250msec=250 millisecond before window "opens"
avrduusb.menu.WDTwindow.125msec=125 millisecond before window "opens"
avrduusb.menu.WDTwindow.63msec=62.5 millisecond before window "opens"
avrduusb.menu.WDTtimeout.disabled.bootloader.wdttimeoutbits=0000
avrduusb.menu.WDTtimeout.8seconds.bootloader.wdttimeoutbits=1011
avrduusb.menu.WDTtimeout.4seconds.bootloader.wdttimeoutbits=1010
avrduusb.menu.WDTtimeout.2seconds.bootloader.wdttimeoutbits=1001
avrduusb.menu.WDTtimeout.1second.bootloader.wdttimeoutbits=1000
avrduusb.menu.WDTtimeout.500msec.bootloader.wdttimeoutbits=0111
avrduusb.menu.WDTtimeout.250msec.bootloader.wdttimeoutbits=0110
avrduusb.menu.WDTtimeout.125msec.bootloader.wdttimeoutbits=0101
avrduusb.menu.WDTtimeout.63msec.bootloader.wdttimeoutbits=0100
avrduusb.menu.WDTwindow.disabled.bootloader.wdtwindowbits=0000
avrduusb.menu.WDTwindow.8seconds.bootloader.wdtwindowbits=1011
avrduusb.menu.WDTwindow.4seconds.bootloader.wdtwindowbits=1010
avrduusb.menu.WDTwindow.2seconds.bootloader.wdtwindowbits=1001
avrduusb.menu.WDTwindow.1second.bootloader.wdtwindowbits=1000
avrduusb.menu.WDTwindow.500msec.bootloader.wdtwindowbits=0111
avrduusb.menu.WDTwindow.250msec.bootloader.wdtwindowbits=0110
avrduusb.menu.WDTwindow.125msec.bootloader.wdtwindowbits=0101
avrduusb.menu.WDTwindow.63msec.bootloader.wdtwindowbits=0100
avrduusb.menu.flmap.unlocked=Start w/default, do not lock flmap. No PROGMEM_MAPPED.
avrduusb.menu.flmap.lockdefault=Use last FLMAP section, lock FLMAP, provide PROGMEM_MAPPED
avrduusb.menu.flmap.locksection0=Set FLMAP to section 0, lock FLMAP, provide PROGMEM_MAPPED
avrduusb.menu.flmap.unlocked.build.flmapopts=
avrduusb.menu.flmap.lockdefault.build.flmapopts=-DLOCK_FLMAP -DFLMAPSECTION1
avrduusb.menu.flmap.locksection0.build.flmapopts=-DLOCK_FLMAP -DFLMAPSECTION0
avrduusb.menu.flmap.unlocked.build.flmapabr=.ful
avrduusb.menu.flmap.lockdefault.build.flmapabr=.fld
avrduusb.menu.flmap.locksection0.build.flmapabr=.fl0
avrduusb.upload.protocol=arduino
avrduusb.upload.speed=115200
avrduusb.upload.extra_params=-D
avrduusb.upload.use_1200bps_touch=true
avrduusb.upload.wait_for_upload_port=true
# --- Chip selection: each chip maps to its USB-CDC bootloader class.
# LED is PA7 on 20/28/32-pin (usbcdcboot_*du) and PD6 on 14-pin
# (usbcdcboot_*du14). 16du and 32du are distinct binaries (RAMSTART
# differs by flash size). max_size = flash - 4096 (4 KB boot section).
avrduusb.menu.chip.avr64du32=AVR64DU32
avrduusb.menu.chip.avr64du28=AVR64DU28
avrduusb.menu.chip.avr32du32=AVR32DU32
avrduusb.menu.chip.avr32du28=AVR32DU28
avrduusb.menu.chip.avr32du20=AVR32DU20
avrduusb.menu.chip.avr32du14=AVR32DU14
avrduusb.menu.chip.avr16du32=AVR16DU32
avrduusb.menu.chip.avr16du28=AVR16DU28
avrduusb.menu.chip.avr16du20=AVR16DU20
avrduusb.menu.chip.avr16du14=AVR16DU14
avrduusb.menu.chip.avr64du32.build.mcu=avr64du32
avrduusb.menu.chip.avr64du32.bootloader.class=usbcdcboot_64du
avrduusb.menu.chip.avr64du32.upload.maximum_size=61440
avrduusb.menu.chip.avr64du32.upload.maximum_data_size=8192
avrduusb.menu.chip.avr64du32.build.highestcb=B2
avrduusb.menu.chip.avr64du32.build.variant=32pin-duseries
avrduusb.menu.chip.avr64du28.build.mcu=avr64du28
avrduusb.menu.chip.avr64du28.bootloader.class=usbcdcboot_64du
avrduusb.menu.chip.avr64du28.upload.maximum_size=61440
avrduusb.menu.chip.avr64du28.upload.maximum_data_size=8192
avrduusb.menu.chip.avr64du28.build.variant=28pin-duseries
avrduusb.menu.chip.avr32du32.build.mcu=avr32du32
avrduusb.menu.chip.avr32du32.bootloader.class=usbcdcboot_32du
avrduusb.menu.chip.avr32du32.upload.maximum_size=28672
avrduusb.menu.chip.avr32du32.upload.maximum_data_size=4096
avrduusb.menu.chip.avr32du32.build.variant=32pin-duseries
avrduusb.menu.chip.avr32du28.build.mcu=avr32du28
avrduusb.menu.chip.avr32du28.bootloader.class=usbcdcboot_32du
avrduusb.menu.chip.avr32du28.upload.maximum_size=28672
avrduusb.menu.chip.avr32du28.upload.maximum_data_size=4096
avrduusb.menu.chip.avr32du28.build.variant=28pin-duseries
avrduusb.menu.chip.avr32du20.build.mcu=avr32du20
avrduusb.menu.chip.avr32du20.bootloader.class=usbcdcboot_32du
avrduusb.menu.chip.avr32du20.upload.maximum_size=28672
avrduusb.menu.chip.avr32du20.upload.maximum_data_size=4096
avrduusb.menu.chip.avr32du20.build.highestcb=B1
avrduusb.menu.chip.avr32du20.build.variant=20pin-duseries
avrduusb.menu.chip.avr32du20.build.defaultswaps=-DMUX_DEFAULT_USART1=2
avrduusb.menu.chip.avr32du14.build.mcu=avr32du14
avrduusb.menu.chip.avr32du14.bootloader.class=usbcdcboot_32du14
avrduusb.menu.chip.avr32du14.upload.maximum_size=28672
avrduusb.menu.chip.avr32du14.upload.maximum_data_size=4096
avrduusb.menu.chip.avr32du14.build.highestcb=B1
avrduusb.menu.chip.avr32du14.build.variant=14pin-duseries
avrduusb.menu.chip.avr32du14.build.defaultswaps=-DMUX_DEFAULT_USART1=2
avrduusb.menu.chip.avr16du32.build.mcu=avr16du32
avrduusb.menu.chip.avr16du32.bootloader.class=usbcdcboot_16du
avrduusb.menu.chip.avr16du32.upload.maximum_size=12288
avrduusb.menu.chip.avr16du32.upload.maximum_data_size=2048
avrduusb.menu.chip.avr16du32.build.variant=32pin-duseries
avrduusb.menu.chip.avr16du28.build.mcu=avr16du28
avrduusb.menu.chip.avr16du28.bootloader.class=usbcdcboot_16du
avrduusb.menu.chip.avr16du28.upload.maximum_size=12288
avrduusb.menu.chip.avr16du28.upload.maximum_data_size=2048
avrduusb.menu.chip.avr16du28.build.variant=28pin-duseries
avrduusb.menu.chip.avr16du20.build.mcu=avr16du20
avrduusb.menu.chip.avr16du20.bootloader.class=usbcdcboot_16du
avrduusb.menu.chip.avr16du20.upload.maximum_size=12288
avrduusb.menu.chip.avr16du20.upload.maximum_data_size=2048
avrduusb.menu.chip.avr16du20.build.highestcb=B1
avrduusb.menu.chip.avr16du20.build.variant=20pin-duseries
avrduusb.menu.chip.avr16du20.build.defaultswaps=-DMUX_DEFAULT_USART1=2
avrduusb.menu.chip.avr16du14.build.mcu=avr16du14
avrduusb.menu.chip.avr16du14.bootloader.class=usbcdcboot_16du14
avrduusb.menu.chip.avr16du14.upload.maximum_size=12288
avrduusb.menu.chip.avr16du14.upload.maximum_data_size=2048
avrduusb.menu.chip.avr16du14.build.highestcb=B1
avrduusb.menu.chip.avr16du14.build.variant=14pin-duseries
avrduusb.menu.chip.avr16du14.build.defaultswaps=-DMUX_DEFAULT_USART1=2
avrduusb.bootloader.file={runtime.platform.path}/bootloaders/hex/{bootloader.class}.hex
avrduusb.bootloader.appspm=

